<template>
  <div class="container lg:grid lg:grid-cols-12 lg:gap-x-4 mb-10">
    <div class="col-start-2 col-end-12 space-y-4">
      <div class="max-w-[800px] mx-auto">
        <p>
          大家好，我是大力走步，目前在一間設計公司擔任網站開發工程師。
          喜歡閱讀、學語言、散步、彈鋼琴還有打籃球（最近越來越少打，快要被踢除了）
        </p>
        <p>
          這邊是我的網站，主要放自己最近在幹嘛、喜歡的音樂之類的。
          之所以會建立一個這樣的網站，有幾個原因：第一點是，我發現全面的認識一個人是一件很有趣的事情，不論是看傳記看到名人不為人知的日常生活，或是看到部落客分享自己對一件事的看法，都很有趣。
        </p>
        <p>第二點是我自己本身也想要藉由分享，整理自己腦中的資訊。</p>
        <br />
      </div>
    </div>
  </div>
</template>
